REGION_TO_CODE = {
    '臺北市': 'A', '臺中市': 'B', '基隆市': 'C', '臺南市': 'D', '高雄市': 'E',
    '臺北縣': 'F', '宜蘭縣': 'G', '桃園縣': 'H', '嘉義市': 'I', '新竹縣': 'J',
    '苗栗縣': 'K', '臺中縣': 'L', '南投縣': 'M', '彰化縣': 'N', '新竹市': 'O',
    '雲林縣': 'P', '嘉義縣': 'Q', '臺南縣': 'R', '高雄縣': 'S', '屏東縣': 'T',
    '花蓮縣': 'U', '臺東縣': 'V', '金門縣': 'W', '澎湖縣': 'X', '陽明山': 'Y',
    '連江縣': 'Z'
}

CODE_TO_REGION = {
    'A': '臺北市', 'a': '臺北市', 'B': '臺中市', 'b': '臺中市', 'C': '基隆市', 'c': '基隆市',
    'D': '臺南市', 'd': '臺南市', 'E': '高雄市', 'e': '高雄市', 'F': '臺北縣', 'f': '臺北縣',
    'G': '宜蘭縣', 'g': '宜蘭縣', 'H': '桃園縣', 'h': '桃園縣', 'I': '嘉義市', 'i': '嘉義市',
    'J': '新竹縣', 'j': '新竹縣', 'K': '苗栗縣', 'k': '苗栗縣', 'L': '臺中縣', 'l': '臺中縣',
    'M': '南投縣', 'm': '南投縣', 'N': '彰化縣', 'n': '彰化縣', 'O': '新竹市', 'o': '新竹市',
    'P': '雲林縣', 'p': '雲林縣', 'Q': '嘉義縣', 'q': '嘉義縣', 'R': '臺南縣', 'r': '臺南縣',
    'S': '高雄縣', 's': '高雄縣', 'T': '屏東縣', 't': '屏東縣', 'U': '花蓮縣', 'u': '花蓮縣',
    'V': '臺東縣', 'v': '臺東縣', 'W': '金門縣', 'w': '金門縣', 'X': '澎湖縣', 'x': '澎湖縣',
    'Y': '陽明山', 'y': '陽明山', 'Z': '連江縣', 'z': '連江縣'
}
